package com.gdschongik.gdsc.domain.member.domain;

import java.util.Arrays;
import java.util.Collections;
import java.util.List;
import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum Department {
    D001("건축학부"),
    D002("건축학부 건축학전공(5년제)"),
    D003("건축학부 실내건축학전공"),
    D004("도시공학과"),
    D005("경영학부"),
    D006("경영학부 경영학전공"),
    D007("무역학전공"),
    D008("건설환경공학과"),
    D009("기계ㆍ시스템디자인공학과"),
    D010("산업・데이터공학과"),
    D011("신소재·화공시스템공학부 신소재공학전공"),
    D012("신소재·화공시스템공학부 화학공학전공"),
    D013("신소재・화공시스템공학부"),
    D014("전자·전기공학부"),
    D015("컴퓨터공학과"),
    D016("건설·도시공학부"),
    D017("건설·도시공학부 도시공학전공"),
    D018("건설·도시공학부 토목공학전공"),
    D019("자율전공(공과대)"),
    D020("정보·컴퓨터공학부"),
    D021("정보·컴퓨터공학부 산업공학전공"),
    D022("정보·컴퓨터공학부 컴퓨터공학전공"),
    D023("정보산업공학전공"),
    D024("정보컴퓨터공학부"),
    D025("컴퓨터・데이터공학부"),
    D026("컴퓨터・데이터공학부 산업・데이터공학전공"),
    D027("컴퓨터・데이터공학부 컴퓨터공학전공"),
    D028("토목공학과"),
    D029("디자인・예술경영학부 디자인경영전공"),
    D030("경제학부"),
    D031("경제학부 경제학전공"),
    D032("공연예술학부(뮤지컬전공)"),
    D033("공연예술학부(실용음악전공)"),
    D034("교양과"),
    D035("바이오헬스융합학부 바이오헬스데이터전공"),
    D036("바이오헬스융합학부 바이오헬스디바이스전공"),
    D037("바이오헬스융합학부 바이오헬스디자인전공"),
    D038("서울캠퍼스 자율전공"),
    D039("융합전공 건축공간예술전공"),
    D040("융합전공 공연예술전공"),
    D041("융합전공 데이터사이언스전공"),
    D042("융합전공 디자인엔지니어링전공"),
    D043("융합전공 문화예술경영전공"),
    D044("융합전공 사물인터넷공학전공"),
    D045("융합전공 스마트도시・데이터사이언스전공"),
    D046("융합전공 지능로봇・공학전공"),
    D047("디자인경영융합학부"),
    D048("산업정보융합학부"),
    D049("디자인・예술경영학부"),
    D050("디자인・예술경영학부 예술경영전공"),
    D051("국어국문학과"),
    D052("독어독문학과"),
    D053("불어불문학과"),
    D054("영어영문학과"),
    D055("금속조형디자인과"),
    D056("도예ㆍ유리과"),
    D057("동양화과"),
    D058("디자인학부"),
    D059("디자인학부 산업디자인전공"),
    D060("디자인학부 시각디자인전공"),
    D061("목조형가구학과"),
    D062("섬유미술ㆍ패션디자인과"),
    D063("예술학과"),
    D064("자율전공(미술대)"),
    D065("조소과"),
    D066("판화과"),
    D067("회화과"),
    D068("경제학과"),
    D069("법학부"),
    D070("법학과"),
    D071("법학부 공법(공공서비스법)전공"),
    D072("법학부 사법(비즈니스・정보법)전공"),
    D073("교육학과"),
    D074("국어교육과"),
    D075("수학교육과"),
    D076("역사교육과"),
    D077("영어교육과");

    private final String departmentName;

    public static List<Department> searchDepartments(String keyword) {
        if (keyword == null) {
            return Collections.emptyList();
        }

        return Arrays.stream(Department.values())
                .filter(department -> department.getDepartmentName().contains(keyword))
                .toList();
    }
}
